export default class DialogServiceProxy extends puremvc.Proxy {
    static NAME = "DialogServiceProxy";

    pageData = {
        loading: false,
        bShow: false,
        data: `1. 引言
作为数据控制者，我们根据赌博法规，有法律义务处理来自玩家的个人数据，以允许他们参与游戏并为他们提供辅助服务。本《隐私政策》解释了我们从玩家收集了何种个人数据，我们收集这些数据的原因以及我们如何使用它们。 通过在网站上注册玩家账户，即表示你同意本《隐私政策》的内容。如果你不同意本《隐私政策》的条款，且不希望向我们提供我们要求的个人信息，请不要使用本网站。 请注意，本《隐私政策》构成你与本公司之间的协议。我们可能会定期修改该政策。虽然我们会尽力通知你此类更改，但我们建议你定期访问此《隐私政策》。你继续使用本网站和/或其服务即表示你同意本《隐私政策》。
2. 我们收集的信息
我们可能要求使用和处理的个人信息应包括但不限于： a）你在我们的账户注册页面上填写表格时提供的任何信息，以及你通过网站或电子邮件进一步提交的任何其他数据（例如：姓名、出生日期、电子邮件地址、电话号码） b）通过网站、电子邮件、网络聊天或通过其他通信方式与我们进行的通信 c）所有玩家账户交易历史，无论是通过网站还是通过其他通信方式进行的 d）网站登录及其详细信息，包括传输数据、IP位置、浏览器/设备数据，网络日志、活动日志及我们系统中记录的其他传输信息 e）我们合理要求的文件和证明，用于验证你的账户、处理充值或提现以及进行反欺诈检查。此类证明可能包括护照扫描，付款单，银行对账单等 f）我们可能不定期进行的调查参与或任何其他客户评估。
3. 我们如何使用你的信息
我们处理从你那里收集的个人信息，以便向你提供我们的服务。我们会将你的信息用于以下目的： a）处理你的投注和交易，这包括你使用信用卡和在线支付系统 b）为你提供你从我们网站寻找到的游戏和其他辅助服务 c）提供客户支持，例如：协助你注册开户和管理你的账户 d）确定并执行必要的验证检查 e）向注册玩家提供有关我们促销优惠的信息，或者从我们选定的业务合作伙伴、联营公司和加盟公司提供促销信息（仅当玩家明确同意接收此类营销材料时） f）监督和调查交易，以防止欺诈、滥用职权、洗钱和其他非法或非正规的博彩活动 g）对汇总数据进行研究和统计分析。 4. 你的数据安全 我们特此确认，在管理你的玩家账户时收集和处理你的个人信息，我们受到有关个人数据保护的严格法律规定的约束。 因此，我们会根据最佳商业惯例和适用法规，努力保护你的个人信息并尊重你的隐私。我们致力于为玩家提供安全服务，将采取一切合理的预防措施，确保你提交给我们的所有数据仍然安全。
4. 你的数据安全
我们特此确认，在管理你的玩家账户时收集和处理你的个人信息，我们受到有关个人数据保护的严格法律规定的约束。 因此，我们会根据最佳商业惯例和适用法规，努力保护你的个人信息并尊重你的隐私。我们致力于为玩家提供安全服务，将采取一切合理的预防措施，确保你提交给我们的所有数据仍然安全。
5. COOKIE政策
当你访问本网站时，我们的系统会自动收集你的访问信息，例如：你的浏览器，IP地址和参考网站。此系列操作可与我们的平台提供商和合作伙伴共同完成。我们可能会从他们那里收到我们网站访问者的一般访问统计或使用数据。未经其他同意，我们不会使用自动收集的信息来识别你的个人身份。 为了收集被讨论中的信息，我们使用cookie和类似的跟踪工具。 Cookie是你访问我们网页时存储在你的计算机或设备上的小文本文件。部分cookie对于本网站的运营至关重要; 其他的改善你的网站体验，并帮助我们提供更好的服务。以下是我们使用的Cookie类型及其用途。 必需的cookies：启用网站的导航和基本功能，例如：访问网站的成员区域。 功能性cookie：允许我们分析你的网站使用情况和你在网站上的选择（例如：你的会话密钥、语言或区域），以便我们保存这些设置并为你提供更个性化的体验。 大多数在线浏览器自动接受cookies。如果你想的话，可以阻止部分或全部cookies，或删除已通过修改浏览器设置而设置的cookie。然而，我们建议你不要阻止或删除你的cookies，因为这可能会限制你使用我们的网站。 本规则与条件的施行为2020年9月1日的修正案，你选择注册和登录本网站且继续使用，则默认为你同意这些条件与条款、以及其他任何强加条件。
6. 特别声明
CF提醒并警告有意与线上投注网进行投注之客户，应注意其国家或居住地的相关法律规定，如有任何疑问应就相关问题，寻求当地法律见解。CF不接受任何客户因违反当地投注或赌博法令所引起之任何责任。CF要求各位客户在接受我们的服务前仔细并完整地阅读该协议。当你在使用我们的服务时，即表示你已阅读、了解并同意接受我们的协议与条规之所有内容，并且承诺一旦违背此协议,将会对你产生以下后果：会员资格被剥夺账户被冻结资金被没收其它相关的法律诉讼
7. 客户注册
用户在注册过程中需要确保注册用户已满18周岁，并已阅读和同意CF的“服务协议”，选择继续注册和登录，即表示用户已确认：用户已经阅读、完全理解并同意本条规，及本条规则构成的用户与 CF 之间关于博彩服务中使用的博彩协议 。如果用户不同意服务协议中的任何条款，请并请不要注册和使用，切勿试图使用或继续使用任何博彩服务或下载和 / 或安装CF博彩软件。
8. 条款修改
我们保留不时修订、更新和修改本条规和博彩规则（或其任何部分）的绝对权利，如果阁下继续使用本网站将被视为你接受相关条款与政策的修改。用户确认并同意，用户自行负责查阅上述修订、更新和 / 或修改，CF 并无任何义务向用户通知上述修订、更新和修改。
9. 使用条件
用户声明并承诺，用户在注册和办理会员资格申请时所提供的所有资料，包括会员资格申请所填用户姓名 、资金来源 ( 包括有关银行账号和卡号 )、任何电子邮箱地址或联系电话以及本人住址，在一切方面均真实、准确、完整。 作为使用博彩服务的条件，用户保证并承诺不得以任何违反适用于用户的任何法律、违反本条规和 / 或被本条规所禁止的目的使用或连接博彩网站、博彩服务、博彩软件和 / 或博彩资讯。用户以本人的身份及名义进行活动，而非代他人进行交易;用户的法律行为能力不受限制;用户未被诊断为赌博成瘾人士，或认为自己并无相关问题;用户充分了解并接受在使用博彩服务的过程中一切的风险问题;用户并非从事犯罪或其他非法、未经授权许可的活动或企图利用用户在 CF 开立的账户从事上述活动；用户不得利用博彩服务或用户的博彩账户从事任何法律所规定的任何犯罪或其他非法活动，包括但不限于洗钱。 对自己的账号密码做好保密措施，防止非法连接或使用，在户名、账号或密码以任何方式失密的情况下立即更改密码或通知我们;对以用户的户名、账号和密码通过博彩网站和 / 或连接设备连接和使用博彩服务的任何及所有活动自行承担责任，不论上述连接和 / 或使用是否经用户授权或为用户所知晓；CF将不会偿付因第三方使用用户账户而造成的任何损失；用户须承担任何第三方使用其登录资料而产生的全部责任，并不得损害CF相关利益。 不上传或散发任何含有病毒、已经毁坏或可能影响连接设备、博彩软件、博彩服务和 / 或博彩网站运行效能的程序、文件或数据;不使用任何设备、机械、装置、软件、程序或其他方法 ( 或任何具有上述性质的事物 ) 干扰或企图干扰博彩服务、连接设备、博彩软件、博彩网站、博彩资讯或博彩网站和 / 或连接设备提供的任何交易的正常运行；尤其不得试图和使用任何智能程序或系统（包括机械、计算机、软件或其他自动化系统）来攻击CF，已达到诈骗网站或用户的目的;不可使用用户未被授权的信用卡和借记卡充值、故意利用此类卡进款，或以各种方式进行诈骗。用户在 CF 仅可开立一个账户。 若我们发现用户在 CF 开设不止一个账户，CF将有权在不通知会员的情况下，自行决定仅保留一个账户，并处理、取消多余账户或与用户终止本协议的权利。为维护游戏的公平性，我们会寻求游戏平台方进行安全审核，在最长120天内给出审核结果并做出回应。一旦确认用户触及游戏或博彩活动的相关规则，CF不排除会冻结用户的游戏账户并扣除账户本金及盈利。`,
    };
    customData = {
        title:"",
        neirong:"",
    }
    resetdata()
    {
        this.customData = {
            title:"",
            neirong:"",
        }
    }
}
