module core {
    export interface UserShowGoldVO {
        /**金币流水LOG_ID*/
        id: 4;
        /**平台用户ID */
        user_id: 100000000;
        /**平台ID */
        plat_id: 10001;
        /**
         * 1-游戏输赢|5-平台充值|6-平台兑换|7-银行存取|8-平台赠送|9-平台兑换失败退款|10-平台扣款
         * 11-游戏厂商上分|12-游戏厂商下分|13-游戏厂商上分失败返还|14-实时返水|15-推广返佣|40-活动赠送
         */
        type: 11;
        /**金币变化前的值 */
        gold_before: "10000.00";
        /**金币变化的值 */
        gold: "10000.00";
        /**创建人 */
        created_by: "system";
        /**创建时间 */
        created_at: "2020-10-13 17:09:29";
        /**金币变化后的值 */
        balance: "20000.00";
    }
}
